---
kind: property
id: P:Autodesk.Revit.DB.RenderingQualitySettings.RenderingQuality
source: html/5d36a63b-ebfa-8daf-5d14-625a528daacb.htm
---
# Autodesk.Revit.DB.RenderingQualitySettings.RenderingQuality Property

The quality applied for rendering.

## Syntax (C#)
```csharp
public RenderingQuality RenderingQuality { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration